In [1]:
import pandas as pd
import numpy as np

In [2]:
repaso_parcial = 'https://github.com/niconomist98/DataAnalyticsUQ/raw/refs/heads/main/Datos/EMICRON/emicron_identificacion.csv'
emicron=pd.read_csv(repaso_parcial)
emicron.head()

,DIRECTORIO,SECUENCIA_P,SECUENCIA_ENCUESTA,COD_DEPTO,AREA,CLASE_TE,P35,P241,MES_REF,P3031,P3032_1,P3032_2,P3032_3,P3033,P3034,P3035,P3000,GRUPOS4,GRUPOS12,F_EXP
0,7627444,1,1,44,NaN,2,2,33,ENERO,2,NaN,NaN,NaN,2,240,2,2,2,3,60.050515
1,7627446,1,1,44,NaN,2,1,31,ENERO,2,NaN,NaN,NaN,2,166,2,2,1,1,86.341075
2,7627449,1,1,68,NaN,1,2,42,ENERO,2,NaN,NaN,NaN,2,60,2,2,3,5,139.884518
3,7627453,1,2,68,NaN,1,2,41,ENERO,2,NaN,NaN,NaN,2,60,2,2,4,7,168.635440
4,7627456,1,3,68,NaN,1,1,18,ENERO,2,NaN,NaN,NaN,2,9,2,2,4,6,64.659273

1. Calcule la cantidad de micronegocios que hay en el dpto del Quindío encabezada por hombres y mujeres entre los 18 y los 28 años

In [3]:
QH1828 = emicron[(emicron['COD_DEPTO'] == 63) & (emicron['P35'] == 1) & (emicron['P241'] >=18) & (emicron['P241'] <=28)]['F_EXP'].sum()
print(f'Cantidad de micronegocios en el Quindío encabezados por hombres entre los 18 y 28 años: {QH1828}')

QM1828 = emicron[(emicron['COD_DEPTO'] == 63) & (emicron['P35'] == 2) & (emicron['P241'] >=18) & (emicron['P241'] <=28)]['F_EXP'].sum()
print(f'Cantidad de micronegocios en el Quindío encabezados por mujeres entre los 18 y 28 años: {QM1828}')

Cantidad de micronegocios en el Quindío encabezados por hombres entre los 18 y 28 años: 1531.3166836231612
Cantidad de micronegocios en el Quindío encabezados por mujeres entre los 18 y 28 años: 2281.821516484595

2. ¿Cuál es la ciudad en la que existen más micronegocios encabezados por hombres entre los 20 y 30 años?

In [4]:
emicron['AREA'].value_counts()
CIUDAD_MH = emicron[(emicron['P35'] == 1) & (emicron['P241'] >=20) & (emicron['P241'] <=30)].groupby('AREA')['F_EXP'].sum().reset_index()
CIUDAD_MH = CIUDAD_MH.sort_values(by='F_EXP', ascending=False).head(1)
print(f'La ciudad con más micronegocios encabezados por hombres entre los 20 y 30 años es: {CIUDAD_MH.iloc[0,0]} con {CIUDAD_MH.iloc[0,1]} micronegocios.')

La ciudad con más micronegocios encabezados por hombres entre los 20 y 30 años es: 5.0 con 46673.06740102969 micronegocios.

3. En el departamento del Tolima, ¿Cuántos micronegocios existen encabezados por mujeres que no tienen una persona que les ayude?

In [5]:
DEPTO_TM = emicron[(emicron['P35'] == 2) & (emicron['COD_DEPTO'] == 73) & (emicron['P3031'] == 2)]['F_EXP'].sum()
print(f'Cantidad de micronegocios en el Tolima encabezados por mujeres que no tienen quién les ayude: {DEPTO_TM}')

Cantidad de micronegocios en el Tolima encabezados por mujeres que no tienen quién les ayude: 28203.211514115817

4. ¿Cuántos micronegocios hay en la ciudad de Bogotá encabezados por mujeres que estén en el sector de la industria manufacturera?

In [6]:
IND_MANU_MM = emicron[(emicron['P35'] == 2) & (emicron['GRUPOS12'] == 3) & (emicron['COD_DEPTO'] == 11)]['F_EXP'].sum()
print(f'Cantidad de micronegocios en Bogotá D.C. del sector manufacturero encabezados por mujeres: {IND_MANU_MM}')

Cantidad de micronegocios en Bogotá D.C. del sector manufacturero encabezados por mujeres: 24601.108849640357

5. Formular pregunta creativa con mínimo 2 variables